---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewDWFXExportOptions
source: html/91d1f87a-b118-599b-1634-0e6ddbe793c7.htm
---
# Autodesk.Revit.Creation.Application.NewDWFXExportOptions Method

Creates DWFX Export options.

## Syntax (C#)
```csharp
public DWFXExportOptions NewDWFXExportOptions()
```